export const QUIZ_LIST = [
  { question: "ダイバーシティマネジメントの説明はどれか。",
    optionA: "従業員が仕事と生活の調和を図り、やりがいをもって業務に取り組み、組織の活力を向上させることである。",
    optionB: "性別や年齢、国籍などの面で従業員の多様性を尊重することによって、組織の活力を向上させることである。",
    optionC: "自ら設定した目標の達成を目指して従業員が主体的に業務に取り組み、その達成度に応じて評価が行われることである。",
    optionD: "労使双方が労働条件についての合意を形成し、協調して収益の増大を目指すことである。",
    answer: "B"
  },
  { question: "3PL（3rd Party Logistics）を説明したものはどれか。",
    optionA: "購買、生産、販売及び物流の一連の業務を、企業間で全体最適の視点から見直し、納期短縮や在庫削減を図る。",
    optionB: "資材の調達から生産、保管、販売に至るまでの物流全体を、費用対効果が最適になるように総合的に管理し、合理化する。",
    optionC: "電子・電機メーカーから、製品の設計や資材の調達、生産、物流、修理を一括して受託する。",
    optionD: "物流業務に加え、流通加工なども含めたアウトソーシングサービスを行い、また荷主企業の物流企画も代行する。",
    answer: "D"
  },
]

export const WORD_LIST = [
    "シフト演算", "ディープラーニング", "フラグメンテーション", "フォールトトレラント", "LRU",
    "リスト構造", "二分探索木", "マージソート", "モンテカルロ法", "TypeScript"
  ];

export const ALARM_STATUS_KEY = "alarmStatus";
